#include "Inventory.h"
#include "../Setup.h"
#include "EconItem.h"

int CInventory::Inventory::LastIndex = 100;
vector<IInventory::Inventory> InventoryList;

class CSharedObjectTypeCache
{
public:
	void AddObject(void* obj)
	{
		typedef void(__thiscall* tOriginal)(void*, void*);
		call_vfunc<tOriginal>(this, 1)(this, obj);
	}

	void RemoveObject(void* obj)
	{
		typedef void(__thiscall* tOriginal)(void*, void*);
		call_vfunc<tOriginal>(this, 3)(this, obj);
	}

	std::vector<CEconItem*> CSharedObjectTypeCache::GetEconItems()
	{
		std::vector<CEconItem*> ret;

		auto size = *reinterpret_cast<size_t*>(this + 0x18);

		auto data = *reinterpret_cast<uintptr_t**>(this + 0x4);

		for (size_t i = 0; i < size; i++)
			ret.push_back(reinterpret_cast<CEconItem*>(data[i]));

		return ret;
	}
};


class C_EconItemView
{
public:
	char pad_0x0000[0x194]; //0x0000
	__int32 m_iItemDefinitionIndex; //0x0194 
	__int32 m_iEntityQuality; //0x0198 
	__int32 m_iEntityLevel; //0x019C 
	char pad_0x01A0[0x8]; //0x01A0
	__int32 m_iItemIDHigh; //0x01A8 
	__int32 m_iItemIDLow; //0x01AC 
	__int32 m_iAccountID; //0x01B0 
	char pad_0x01B4[0x8]; //0x01B4
	unsigned char m_bInitialized; //0x01BC 
	char pad_0x01BD[0x67]; //0x01BD
	char m_szCustomName[32]; //0x0224 

};//Size=0x0244

class CPlayerInventory
{
public:
	void RemoveItem(uint64_t ID)
	{
		static auto fnRemoveItem
			= reinterpret_cast<int(__thiscall*)(void*, int64_t)>(
				CSX::Memory::FindSignature("client_panorama.dll", "55 8B EC 83 E4 F8 56 57 FF 75 0C 8B F1")
				);

		fnRemoveItem(this, ID);
	}

	void RemoveItem(CEconItem* item)
	{
		RemoveItem(*item->GetItemID());
		GetBaseTypeCache()->RemoveObject(item);
	}

	void ClearInventory()
	{
		auto BaseTypeCache = this->GetBaseTypeCache();
		auto items = BaseTypeCache->GetEconItems();
		for (auto item : items)
		{
			RemoveItem(*item->GetItemID());
			BaseTypeCache->RemoveObject(item);
		}
	}

	CSharedObjectTypeCache* CPlayerInventory::GetBaseTypeCache()
	{
		static auto fnGCSDK_CGCClient_FindSOCache
			= reinterpret_cast<uintptr_t(__thiscall*)(uintptr_t, uint64_t, uint64_t, bool)>(
				CSX::Memory::FindSignature("client_panorama.dll", "55 8B EC 83 E4 F8 83 EC 1C 0F 10 45 08")
				);

